#include<iostream>
using namespace std;

int main4()
{
	//1.将所有的三位数进行输出 (100~999)
	int num = 100;
	do
	{
	
		//2.在所有三位数中找到水仙花数
		int a = 0;//个位
		int b = 0;//十位
		int c = 0;//百位

		a = num % 10;//获取数字个位
		b = num / 10 % 10;//获取数字的十位
		c = num / 100;//获取数字的百位 
		if (a*a*a+b*b*b+c*c*c==num)//如果是水仙花数 才打印
		{
			cout << num << endl;
		}
		num++;
	
	} while (num<1000 );
	
		
	//	水仙花数     153
	//获取个位		153%10=3	对数字取模于10 可以获取到个位
	//获取十位		153/!0=15	15%10=5 先整除于10,得到两位数 在取模于10 得到十位
	//获取百位		153/100=1	直接整除于100 获取百位

	//判断	个位 ^3	+	十位^3 + 百位^3 = 本身

	system("pause");
	return  0;
}
